/*
 * Copyright (c) 2018. juzhen.io. All rights reserved.
 */

// ------------------------------------------------------------------------------------------
// General apiDoc documentation blocks and old history blocks.
// ------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------
// Current Success.
// ------------------------------------------------------------------------------------------


// ------------------------------------------------------------------------------------------
// Current Common Filed.
// ------------------------------------------------------------------------------------------
/**
 * @apiDefine ReturnCommonFiled
 *   公共返回码和错误描述
 *
 * @apiSuccess {Number} result 结果码
 * @apiSuccess {String} errMsg 错误描述
 */

// ------------------------------------------------------------------------------------------
// Current Page Filed.
// ------------------------------------------------------------------------------------------
/**
 * @apiDefine PageParam
 *   分页公共参数
 *
 * @apiParam {Number} [pageNo=1] 当前页
 * @apiParam {Number} [pageSize=10] 页大小
 */

/**
 * @apiDefine ReturnPage
 *   分页总条数
 *
 * @apiSuccess {Number} totalCount 总条数
 */

// ------------------------------------------------------------------------------------------
// Current Header Filed.
// ------------------------------------------------------------------------------------------
/**
 * @apiDefine CommonHeaderFiled
 *
 * @apiHeader {String} [Content-Type=application/json;charset=UTF-8]
 */